#### Project 4: explore Stanford's school enrollment data

##### 1) create BQ dataset:

In [1]:
dataset_id = "school_enrollments"

In [2]:
!bq --location=US mk --dataset {dataset_id}

BigQuery error in mk operation: Dataset 'wide-memento-324619:school_enrollments'
already exists.

##### 2) create and populate BQ tables:

In [3]:
import os

In [4]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access/school-enrollments/*"
file_listings = os.popen(gsutil_cmd)

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset_id + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access/school-enrollments/zf406jp4427_ak.csv

Waiting on bqjob_r1dfe7ad58431e6d0_0000017c1a1713e1_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access/school-enrollments/zf406jp4427_ar.csv

Waiting on bqjob_r4afab722392cf170_0000017c1a1725cf_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access/school-enrollments/zf406jp4427_ca.csv

Waiting on bqjob_r522085edf78704cc_0000017c1a173fb1_1 ... (9s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access/school-enrollments/zf406jp4427_ct.csv

Waiting on bqjob_r720b465e366cb52c_0000017c1a176eb9_1 ... (3s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access/school-enrollments/zf406jp4427_hi.csv

Waiting on bqjob_r6a47008c8ebd9ca0_0000017c1a1784fb_1 ... (3s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access/school-enrollments/zf406jp4427_la.csv

Waiting on bqjob_r742a0a5b4b01b687_0000017c1a179a95_1 ... (3s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access/school-enrollments/zf406jp4427_md.csv

Waiting on bqjob_r3ff357f3207a848d_0000017c1a17b004_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access/school-enrollments/zf406jp4427_mn.csv

Waiting on bqjob_r4bf037083fd5d0d0_0000017c1a17c183_1 ... (6s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access/school-enrollments/zf406jp4427_ms.csv

Waiting on bqjob_r2e0eb32ffe08a7e6_0000017c1a17e3cb_1 ... (2s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access/school-enrollments/zf406jp4427_nh.csv

Waiting on bqjob_r4ea88441b2220aa6_0000017c1a17f513_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access/school-enrollments/zf406jp4427_nv.csv

Waiting on bqjob_rb18276d5a5619e7_0000017c1a180728_1 ... (2s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access/school-enrollments/zf406jp4427_ok.csv

Waiting on bqjob_r63137e56b620c7f_0000017c1a1818af_1 ... (6s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access/school-enrollments/zf406jp4427_pa.csv

Waiting on bqjob_r2fe4c2a2fa76b299_0000017c1a183abe_1 ... (3s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access/school-enrollments/zf406jp4427_sc.csv

Waiting on bqjob_r782c259bdf2a6538_0000017c1a18507e_1 ... (3s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access/school-enrollments/zf406jp4427_tx.csv

Waiting on bqjob_r1174317c3e7c2e34_0000017c1a1865d9_1 ... (3s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access/school-enrollments/zf406jp4427_wa.csv

Waiting on bqjob_r48b948e62b2f2343_0000017c1a187b1c_1 ... (6s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access/school-enrollments/zf406jp4427_wy.csv

Waiting on bqjob_r56bc9fa2e1bf57b2_0000017c1a189ca0_1 ... (2s) Current status: DONE

#### 3) Find school enrollments by school name, grade level, and year for Texas

In [5]:
!bq show --schema=true {dataset_id}.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [7]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from `school_enrollments.tx`
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1887.63query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 1164.05rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020    720
1     AKINS H S          grade_10  2021    747
2     AKINS H S          grade_11  2020    664
3     AKINS H S          grade_11  2021    663
4     AKINS H S          grade_12  2020    609
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021     69
1735  ZILKER EL      kindergarten  2020     77
1736  ZILKER EL      kindergarten  2021     63
1737  ZILKER EL  pre_kindergarten  2020     30
1738  ZILKER EL  pre_kindergarten  2021     13

[1739 rows x 4 columns]

##### Note: BQ string functions documentation: 
##### https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [8]:
!bq --location=US mk --dataset "views"

Dataset 'wide-memento-324619:views' successfully created.

In [9]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from `school_enrollments.tx`
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 839.36query/s]

Empty DataFrame
Columns: []
Index: []

In [2]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query complete after 0.01s: 100%|██████████| 3/3 [00:00<00:00, 1083.61query/s]
Downloading: 100%|██████████| 1739/1739 [00:00<00:00, 2356.07rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020    720
1     AKINS H S          grade_10  2021    747
2     AKINS H S          grade_11  2020    664
3     AKINS H S          grade_11  2021    663
4     AKINS H S          grade_12  2020    609
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021     69
1735  ZILKER EL      kindergarten  2020     77
1736  ZILKER EL      kindergarten  2021     63
1737  ZILKER EL  pre_kindergarten  2020     30
1738  ZILKER EL  pre_kindergarten  2021     13

[1739 rows x 4 columns]

#### 4) Open Data Studio and create chart from view:
##### https://datastudio.google.com/

#### Project 4 homework marker. Start homework from here.

### Selects each district in TX with more than 50 distinct schools, ordered by school count descending

In [35]:
%%bigquery 
select district, count(distinct school) as school_count
from `school_enrollments.tx`
group by district
having count(distinct school) >= 50
order by school_count desc

Query complete after 0.00s: 100%|██████████| 4/4 [00:00<00:00, 2418.51query/s]
Downloading: 100%|██████████| 33/33 [00:00<00:00, 35.24rows/s]

                     district  school_count
0                 HOUSTON ISD           280
1                  DALLAS ISD           253
2              FORT WORTH ISD           145
3                  AUSTIN ISD           132
4               NORTHSIDE ISD           124
5         IDEA PUBLIC SCHOOLS           112
6             SAN ANTONIO ISD           101
7       CYPRESS-FAIRBANKS ISD            89
8                 EL PASO ISD            88
9               FORT BEND ISD            81
10                 ALDINE ISD            80
11              ARLINGTON ISD            79
12             NORTH EAST ISD            76
13                  PLANO ISD            74
14                   KATY ISD            73
15                 FRISCO ISD            72
16                GARLAND ISD            71
17               PASADENA ISD            68
18                 YSLETA ISD            67
19                 CONROE ISD            63
20             LEWISVILLE ISD            63
21  KIPP TEXAS PUBLIC SCHOOLS            60
22             ROUND ROCK ISD            60
23         CORPUS CHRISTI ISD            59
24               AMARILLO ISD            58
25             RICHARDSON ISD            56
26                KILLEEN ISD            55
27            BROWNSVILLE ISD            53
28                  KLEIN ISD            52
29                LUBBOCK ISD            52
30                SOCORRO ISD            52
31               MESQUITE ISD            50
32                 UNITED ISD            50

### Shows total students for each district with "Austin" in the name

In [31]:
%%bigquery
select district, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from `school_enrollments.tx`
where total != "" and school != "" and district like '%AUSTIN%'
group by district
order by district
limit 10

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1626.33query/s]
Downloading: 100%|██████████| 6/6 [00:00<00:00,  6.62rows/s]

                            district   total
0      AUSTIN ACHIEVE PUBLIC SCHOOLS    4052
1            AUSTIN DISCOVERY SCHOOL     884
2                         AUSTIN ISD  157608
3   HARMONY SCIENCE ACADEMY (AUSTIN)    8732
4  STEPHEN F AUSTIN STATE UNIVERSITY     509
5  UNIVERSITY OF TEXAS AT AUSTIN H S     521

### Counts the total number of charter schools in each district in Texas with "Academy" in the name, ordered by charter count descending

In [55]:
%%bigquery
select district, count(distinct school) as charter_count
from `school_enrollments.tx`
where ccd_charter_school is True
group by district
having district like '%ACADEMY%'
order by charter_count desc

Query complete after 0.00s: 100%|██████████| 4/4 [00:00<00:00, 2219.21query/s]
Downloading: 100%|██████████| 78/78 [00:01<00:00, 45.48rows/s]

                              district  charter_count
0     HARMONY SCIENCE ACADEMY (AUSTIN)              7
1              HARMONY SCIENCE ACADEMY              6
2      WINFREE ACADEMY CHARTER SCHOOLS              6
3   NEWMAN INTERNATIONAL ACADEMY OF AR              6
4                     HERITAGE ACADEMY              5
..                                 ...            ...
73      MIDLAND ACADEMY CHARTER SCHOOL              1
74                        NOVA ACADEMY              1
75      PROMESA ACADEMY CHARTER SCHOOL              1
76                        RISE ACADEMY              1
77    ST MARY'S ACADEMY CHARTER SCHOOL              1

[78 rows x 2 columns]

### Selects the number of students who have an unknown race from elementary schools in CA

In [66]:
%%bigquery
select school, count(unknown_race) as students_with_unknown_race
from `school_enrollments.ca`
where total > 0
group by school
having school like '%Elementary%'
order by students_with_unknown_race desc

Query complete after 0.00s: 100%|██████████| 4/4 [00:00<00:00, 1725.87query/s]
Downloading: 100%|██████████| 3983/3983 [00:01<00:00, 2259.88rows/s]

                                        school  students_with_unknown_race
0                           Lincoln Elementary                         464
1                        Washington Elementary                         407
2                         Jefferson Elementary                         346
3                         Roosevelt Elementary                         321
4                          McKinley Elementary                         281
...                                        ...                         ...
3978                         Dunham Elementary                           4
3979  Bishop Union Elementary Community Day II                           3
3980     Bishop Union Elementary Community Day                           2
3981                     CDS Bishop Elementary                           2
3982   Aspire Stockton TK-5 Elementary Academy                           2

[3983 rows x 2 columns]

### Selects total number of students from schools in both California and Nevada and orders by student count descending

In [87]:
%%bigquery
select school, sum(total) as student_count
from `school_enrollments.ca`
where total != 0 and school != ""
group by school

union distinct

select school, sum(total) as student_count
from `school_enrollments.nv`
where total != 0 and school != ""
group by school

order by student_count desc

Query complete after 0.00s: 100%|██████████| 5/5 [00:00<00:00, 2954.98query/s]
Downloading: 100%|██████████| 10027/10027 [00:00<00:00, 10785.30rows/s]

                                         school  student_count
0                            Lincoln Elementary        62400.0
1                         Washington Elementary        53056.0
2                          Jefferson Elementary        49622.0
3                          Roosevelt Elementary        46480.0
4               Nonpublic, Nonsectarian Schools        41834.0
...                                         ...            ...
10022                 Gravenstein Community Day            2.0
10023                                    Harper            2.0
10024  Yucaipa Early Childhood Education Center            2.0
10025                  Orange Unified Pre-K SDC            2.0
10026                           Juvenile Det ES            2.0

[10027 rows x 2 columns]

### Gender counts for elementary schools in CA and NV

In [99]:
%%bigquery
select state, school, sum(male) as male_count, sum(female) as female_count
from `school_enrollments.ca`
where total > 0
group by state, school
having school like '%Elementary%'

union distinct

select state, school, sum(male) as male_count, sum(female) as female_count
from `school_enrollments.nv`
where total > 0
group by state, school
having school like '%ES%'

order by school

Query complete after 0.00s: 100%|██████████| 5/5 [00:00<00:00, 2683.50query/s]
Downloading: 100%|██████████| 4397/4397 [00:00<00:00, 5104.05rows/s]

     state                     school  male_count  female_count
0       CA    A. E. Arnold Elementary      1204.0        1362.0
1       CA      A. G. Cook Elementary       668.0         820.0
2       CA     A. J. Dorsa Elementary       712.0         720.0
3       CA    A. L. Conner Elementary       642.0         666.0
4       CA  ACORN Woodland Elementary       572.0         542.0
...    ...                        ...         ...           ...
4392    CA          Zamora Elementary       864.0         778.0
4393    CA        Zamorano Elementary      1880.0        2048.0
4394    CA   Zehnder Ranch Elementary      2494.0        2600.0
4395    NV             Zephyr Cove ES       146.0         161.0
4396    CA     Zephyr Lane Elementary      1610.0        1546.0

[4397 rows x 4 columns]

### Selects the amount of students in each grade in Texas, ordered by student count descending

In [104]:
%%bigquery
select grade, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from `school_enrollments.tx`
where total != ''
group by grade
order by total desc

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2022.00query/s]
Downloading: 100%|██████████| 15/15 [00:01<00:00,  8.38rows/s]

               grade    total
0            grade_9  1776474
1            grade_7  1693399
2            grade_6  1677288
3            grade_8  1671814
4           grade_10  1661520
5            grade_5  1629148
6            grade_4  1573892
7            grade_1  1549062
8            grade_3  1549059
9            grade_2  1540968
10          grade_11  1537096
11      kindergarten  1495160
12          grade_12  1443246
13  pre_kindergarten   910330
14   early_education   125846

### Number of students in each district in CA

In [106]:
%%bigquery
select district, sum(total) as num_students
from `school_enrollments.ca`
where total > 0
group by district
order by district

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1515.65query/s]
Downloading: 100%|██████████| 1026/1026 [00:00<00:00, 1137.84rows/s]

                             district  num_students
0                         ABC Unified      159052.0
1                 Acalanes Union High       44554.0
2                    Ackerman Charter        4664.0
3            Acton-Agua Dulce Unified       96442.0
4                 Adelanto Elementary       65572.0
...                               ...           ...
1021           Yreka Union Elementary        7632.0
1022                 Yreka Union High        5388.0
1023                Yuba City Unified      103080.0
1024  Yuba County Office of Education        5036.0
1025   Yucaipa-Calimesa Joint Unified       78148.0

[1026 rows x 2 columns]

In [108]:
%%bigquery
create view views.charter_academies as
select district, count(distinct school) as charter_count
from `school_enrollments.tx`
where ccd_charter_school is True
group by district
having district like '%ACADEMY%'
order by charter_count desc

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1220.34query/s]

Empty DataFrame
Columns: []
Index: []

In [109]:
%%bigquery
create view views.unknown_races_in_ca as
select school, count(unknown_race) as students_with_unknown_race
from `school_enrollments.ca`
where total > 0
group by school
having school like '%Elementary%'
order by students_with_unknown_race desc

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1161.54query/s]

Empty DataFrame
Columns: []
Index: []